{
    "recommendations": {
        "Budget": {
            "title": "Budget",
            "shortDescription": "Here's what we found for you...",
            "resources": {
                "1": {
                    "title": "The 50/30/20 Plan",
                    "description": "The 50/30/20 rule is a simple budgeting method. It suggests spending 50% of your income on essentials like housing and food, 30% on wants such as entertainment, and 20% on savings and debt repayment. This helps you manage your money by balancing needs, wants, and future security.",
                    "link": "https://www.nerdwallet.com/article/finance/nerdwallet-budget-calculator",
                    "logic": "budgetFunc1" 
                },
                "2": {
                    "title": "Create a budget to pay off debt",
                    "description": "Consider methods of budgetting that can help you pay off debt. This can include the snowball method, avalanche method, or the 50/30/20 rule.",
                    "link": "https://www.lendingtree.com/personal/budget-to-pay-off-debt/",
                    "logic": "budgetFunc2" 
                },
                "3": {
                    "title": "Looking towards retirement?",
                    "description": "Investigate the zero-based budgeting method. This method is a way of budgeting where your income minus your expenses equals zero. That's every dollar of your income assigned a job. This method can help you save for retirement.",
                    "link": "https://www.ramseysolutions.com/budgeting/how-to-make-a-zero-based-budget",
                    "logic": "budgetFunc3" 
                }
            }
        },
        "Debt": {
            "title": "Debt",
            "shortDescription": "Here's what we found for you...",
            "resources": {
                "1": {
                    "title": "Paying off your medical debt",
                    "description": "Medical debt can be overwhelming, but there are resources available to help you manage it. With the information you've given us, we believe you qualify for UNDUE Medical Debt's assistance.",
                    "link": "https://www.unduemedicaldebt.org/medical-debt-resources/",
                    "logic": "debtFunction1" 
                },
                "2": {
                    "title": "Paying off your student loans wiht loan forgiveness programs",
                    "description": "These programs can help you reduce or eliminate your student loan debt. With the information you've given us, we believe you may qualify for the Department of Education's debt relief program.",
                    "link": "https://studentaid.gov/manage-loans/forgiveness-cancellation/debt-relief-info",
                    "logic": "debtFunction2" 
                },
                "3": {
                    "title": "Paying off you student loans with Income-Driven Repayment",
                    "description": "You may not qualify for loan forgiveness, but you could benefit from an income-driven repayment plan. This plan can help you manage your student loan debt by adjusting your monthly payments based on your income.",
                    "link": "https://studentaid.gov/manage-loans/repayment/plans/income-driven",
                    "logic": "debtFunction3" 
                },
                "4": {
                    "title": "Paying off your credit card debt",
                    "description": "You may benefit from a debt relief program. With the information you've given us, we believe you qualify for Accredited Debt Relief's assistance. Accredited Debt Relief can help you consolidate your debt and reduce your monthly payments. Speak to a professional in minutes.",
                    "link": "https://www.accrediteddebtrelief.com/free-quote/ocp/aff/questionnaire/debt_amount/?affiliate_id=152&campaign_id=2717&click_id=cr5r41t296uce9m01p5g&offer_id=13&request_id=2-cr5r41t296uce9m01p70&subid1=b775de06fb5e44c7844f801ccb908673&subid2=&subid3=&subid4=&subid5=2717&utm_campaign=14-2717&utm_medium=affiliate&utm_source=152#debt_amount",
                    "logic": "debtFunction4" 
                },
                "5": {
                    "title": "Paying off your debt",
                    "description": "If you have debt, you may benefit from a debt relief program. With the information you've given us, we believe you qualify for National Debt Relief's assistance. National Debt Relief can help you consolidate your debt and reduce your monthly payments. Speak to a professional in minutes.",
                    "link": "https://www.nationaldebtrelief.com/apply/",
                    "logic": "debtFunction5" 
                },
                "6": {
                    "title": "Understanding your debt",
                    "description": "Check out nerdwallet and other resources to understand your debt and how to pay it off. Ensure you know which debt relief method is best for you. Be mindful of scams and predatory lenders.",
                    "link": "https://www.nerdwallet.com/article/finance/find-debt-relief",
                    "logic": "debtFunction6" 
                },
                "7": {
                    "title": "Credit Card debt is stressful, talk to a professional",
                    "description": "Speaking to a credit coumselor give you peace of mind and help you understand your options. They can help you budget, connect you with educational resources, and help you negotiate with creditors. Ensure you find a credible credit counselor who is transparent about fees and licensing.",
                    "link": "https://consumer.ftc.gov/articles/how-get-out-debt#Credit%20Counseling",
                    "logic": "debtFunction7"
                }
            }
        }
    }
}